app/views/epicenter/_current_user_stats.html.erb

		<div class="col-md-4">
			<%= link_to current_user.tweets.count, show_user_path(id: current_user.id), class: "no-underline" %>
---
SELECT "tweets".* FROM "tweets" ORDER BY created_at DESC
SELECT COUNT(*) FROM "tweets" WHERE "tweets"."user_id" = ?  [["user_id", 1]]