app/views/epicenter/show_user.html.erb

<div class="bioRhyme">
	<% @user.tweets.each do |tweet| %>
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" = ?  [["user_id", 1]]