app/controllers/epicenter_controller.rb

  def feed
    @tweet = Tweet.new

    @followercount = 0
    User.all.each do |u|
      if u.following.include?(current_user.id)
        @followercount += 1
      end
    end

  	@following_tweets = []

  	Tweet.all.each do |tweet|
---
SELECT "users".* FROM "users"
SELECT "tweets".* FROM "tweets" ORDER BY created_at DESC

  def tag_tweets
    @tag = Tag.find(params[:id])
---
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def show_user
  	@user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def now_following
  	current_user.following.push(params[:id].to_i)
---
UPDATE "users" SET "following" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["following", "---\n- 1\n"], ["updated_at", 2016-10-11 12:39:53 UTC], ["id", 2]]

  def following
    @users = []

    User.all.each do |user|
---
SELECT "users".* FROM "users"

  def followers
    @users = []

    User.all.each do |user|
---
SELECT "users".* FROM "users"

  def all_users
    @users = User.all
---
SELECT "users".* FROM "users"