app/controllers/tweets_controller.rb

  def create
    @tweet = Tweet.create(tweet_params)

    @tweet = get_tagged(@tweet)

    respond_to do |format|
      if @tweet.save
---
INSERT INTO "tweets" ("message", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["message", "Kickin ass taking git's"], ["user_id", 1], ["created_at", 2016-10-11 12:37:41 UTC], ["updated_at", 2016-10-11 12:37:41 UTC]]
INSERT INTO "tags" ("phrase", "created_at", "updated_at") VALUES (?, ?, ?)  [["phrase", "#yupYoloFaced"], ["created_at", 2016-10-11 14:38:05 UTC], ["updated_at", 2016-10-11 14:38:05 UTC]]
UPDATE "tweets" SET "message" = ?, "updated_at" = ? WHERE "tweets"."id" = ?  [["message", "<a href=' /tag_tweets?id=1'>#yupYoloFaced</a> what"], ["updated_at", 2016-10-11 14:38:05 UTC], ["id", 3]]